In [2]:
import pandas as pd

In [4]:
dict1= dict()
dict1 = {'Infosys':1200,'Wipro':1567,'Ibm':1900,'Tcs':1827,'Techmahindra':1404}
series3 = pd.Series(dict1)
series3

Infosys         1200
Wipro           1567
Ibm             1900
Tcs             1827
Techmahindra    1404
dtype: int64

In [5]:
print(series3['Wipro'])
series3[2] = 1400
series3

1567

Infosys         1200
Wipro           1567
Ibm             1400
Tcs             1827
Techmahindra    1404
dtype: int64

In [25]:
series3[:2]

Infosys    1200
Wipro      1567
dtype: int64

In [31]:
print(series3 > 200)

series3[series3>1300]

Infosys         True
Wipro           True
Ibm             True
Tcs             True
Techmahindra    True
dtype: bool

Wipro           1567
Ibm             1400
Tcs             1827
Techmahindra    1404
dtype: int64

In [33]:
ser4 = series3 * series3
ser4

Infosys         1440000
Wipro           2455489
Ibm             1960000
Tcs             3337929
Techmahindra    1971216
dtype: int64

In [35]:
ser4[1:]

Wipro           2455489
Ibm             1960000
Tcs             3337929
Techmahindra    1971216
dtype: int64

In [37]:
ser4[:-1]

Infosys    1440000
Wipro      2455489
Ibm        1960000
Tcs        3337929
dtype: int64

In [44]:
ser3 = ser4[1:] + ser4[:-1]
type(ser3)

pandas.core.series.Series

In [122]:
##Dataframes
dict1 = {'Infosys':pd.Series({"day1":1100,"day2" : 1105,"day3": 1190,"day4": 1200,"day5": 1145,"day6":1300}),
         'Wipro':pd.Series({"day1":2100,"day2" : 2105,"day3": 2190,"day4": 2200,"day5": 2145,"day6":2300}),
         'Ibm':pd.Series({"day1":3100,"day2" : 3105,"day3": 3190,"day4": 3200,"day5": 3145,"day6":3300}),
         'Tcs':pd.Series({"day1":4100,"day2" : 4105,"day3": 4190,"day4": 4200,"day5": 4145,"day6":4300}),
         'Techmahindra':pd.Series({"day1":5100,"day2" : 5105,"day3": 5190,"day4": 5200,"day5": 5145,"day6":5300})}

seriesofseries = pd.Series(dict1)
pd.DataFrame(seriesofseries)

      Infosys  Wipro   Ibm   Tcs  Techmahindra
day1     1100   2100  3100  4100          5100
day2     1105   2105  3105  4105          5105
day3     1190   2190  3190  4190          5190
day4     1200   2200  3200  4200          5200
day5     1145   2145  3145  4145          5145
day6     1300   2300  3300  4300          5300

In [6]:
dict1 = {'Infosys':pd.Series([1100,1105,1190,1200,1145,1300]),
         'Wipro':pd.Series([2100,2105,2190,2200,2145,2300]),
         'Ibm':pd.Series([3100,3105,3190,3200,3145,3300]),
         'Tcs':pd.Series([4100,4105,4190,4200,4145,4300]),
         'Techmahindra':pd.Series([5100,5105,5190,5200,5145,5300])}

seriesofseries1 = pd.Series(dict1)

df1 = pd.DataFrame(dict1)
df1

   Infosys  Wipro   Ibm   Tcs  Techmahindra
0     1100   2100  3100  4100          5100
1     1105   2105  3105  4105          5105
2     1190   2190  3190  4190          5190
3     1200   2200  3200  4200          5200
4     1145   2145  3145  4145          5145
5     1300   2300  3300  4300          5300

In [77]:
dict1 = {'Infosys':pd.Series({"day1":1100,"day2" : 1105,"day3": 1190,"day4": 1200,"day5": 1145,"day6":1300}),
         'Wipro':pd.Series({"day1":2100,"day2" : 2105,"day3": 2190,"day4": 2200,"day5": 2145,"day6":2300}),
         'Ibm':pd.Series({"day1":3100,"day2" : 3105,"day3": 3190,"day4": 3200,"day5": 3145,"day6":3300}),
         'Tcs':pd.Series({"day1":4100,"day2" : 4105,"day3": 4190,"day4": 4200,"day5": 4145,"day6":4300}),
         'Techmahindra':pd.Series({"day1":5100,"day2" : 5105,"day3": 5190,"day4": 5200,"day5": 5145,"day6":5300})}

df1 = pd.DataFrame(dict1)
df1

      Infosys  Wipro   Ibm   Tcs  Techmahindra
day1     1100   2100  3100  4100          5100
day2     1105   2105  3105  4105          5105
day3     1190   2190  3190  4190          5190
day4     1200   2200  3200  4200          5200
day5     1145   2145  3145  4145          5145
day6     1300   2300  3300  4300          5300

In [83]:
dict1 = [[1100,1105,1190,1200,1145,1300],
         [2100,2105,2190,2200,2145,2300],
         [3100,3105,3190,3200,3145,3300],
         [4100,4105,4190,4200,4145,4300],
         [5100,5105,5190,5200,5145,5300]]

seriesofseries1 = pd.Series(dict1)
print(seriesofseries1)
df1 = pd.DataFrame(dict1)
df1

0    [1100, 1105, 1190, 1200, 1145, 1300]
1    [2100, 2105, 2190, 2200, 2145, 2300]
2    [3100, 3105, 3190, 3200, 3145, 3300]
3    [4100, 4105, 4190, 4200, 4145, 4300]
4    [5100, 5105, 5190, 5200, 5145, 5300]
dtype: object

      0     1     2     3     4     5
0  1100  1105  1190  1200  1145  1300
1  2100  2105  2190  2200  2145  2300
2  3100  3105  3190  3200  3145  3300
3  4100  4105  4190  4200  4145  4300
4  5100  5105  5190  5200  5145  5300

In [8]:
import numpy as np

In [9]:
## using structured array

df3 = np.zeros((4,),dtype = [('Name','U25'),('Gender','U10'),('Present/Absent','U15')])
df3

array([('', '', ''), ('', '', ''), ('', '', ''), ('', '', '')],
      dtype=[('Name', '<U25'), ('Gender', '<U10'), ('Present/Absent', '<U15')])

In [119]:
df3[:] =[('Joseph',"male","Absent"),('Ram',"male","Absent"),('Rahim',"male","Present"),('swathi',"female","Absent")]
df3

array([('Joseph', 'male', 'Absent'), ('Ram', 'male', 'Absent'),
       ('Rahim', 'male', 'Present'), ('swathi', 'female', 'Absent')],
      dtype=[('Name', '<U25'), ('Gender', '<U10'), ('Present/Absent', '<U15')])

In [11]:
df3[0:1] =[('Joseph',"male","Absent")]
df3

array([('Joseph', 'male', 'Absent'), ('', '', ''), ('', '', ''),
       ('', '', '')],
      dtype=[('Name', '<U25'), ('Gender', '<U10'), ('Present/Absent', '<U15')])

In [15]:
dict1= dict()
dict1 = {'Infosys':1200,'Wipro':1567,'Ibm':1900,'Tcs':1827,'Techmahindra':1404}
dict2 = {'Infosys':1300,'Wipro':1467,'Ibm':1800,'Tcs':1927,'Techmahindra':1504}
series3 = pd.Series(dict1)
series4 = pd.Series(dict2)
#print(pd.DataFrame(dict1,dict2))
#print(pd.DataFrame(pd.Series.append(series3,series4)) ) #for rows

pd.concat([series3,series4],axis = 1) # perfect solution

                 0     1
Infosys       1200  1300
Wipro         1567  1467
Ibm           1900  1800
Tcs           1827  1927
Techmahindra  1404  1504

In [19]:
pd2 = pd.DataFrame([series3,series4],axis = 1)) 
pd2.columns = ['a','b']
pd2

TypeError: __init__() got an unexpected keyword argument 'axis'

In [4]:
import pandas as pd,numpy as np

In [5]:
df2 = pd.DataFrame(np.random.randint(low=0, high=10, size=(5, 5)),columns=['a', 'b', 'c', 'd', 'e'])
df2

   a  b  c  d  e
0  7  2  2  8  8
1  3  1  1  8  8
2  4  0  3  8  0
3  2  2  7  1  8
4  4  0  0  2  4

In [23]:
df2[:2]

   a  b  c  d  e
0  7  2  2  8  8
1  3  1  1  8  8

In [7]:
# operations on dataframes

print(df2[0:1]['a'])
x1 = df2['a']
print(type(x1))
x1

0    7
Name: a, dtype: int32
<class 'pandas.core.series.Series'>

0    7
1    3
2    4
3    2
4    4
Name: a, dtype: int32

In [44]:
df2.iloc[0:2,0:2]

   a  b
0  7  2
1  3  1

In [26]:
print(pd2)
pd2[2:3][:] = 1666
pd2

NameError: name 'pd2' is not defined

In [218]:
del df2['e']
df2

   a     f   b  c  d
0  3  3400   5  6  7
1  2  3400   3  4  6
2  7  3400  56  0  3
3  5  3400   6  6  0
4  7  3400   0  8  8

In [219]:
df2['b'][2] = 56
df2

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

   a     f   b  c  d
0  3  3400   5  6  7
1  2  3400   3  4  6
2  7  3400  56  0  3
3  5  3400   6  6  0
4  7  3400   0  8  8

In [224]:
df2.insert(3,'wow',[46,0,90,89,76])
df2

   a     f   b  wow   how    gi  c  d   ghu
0  3  3400   5   46  4600  4600  6  7  4600
1  2  3400   3    0  4600  4600  4  6  4600
2  7  3400  56   90  4600  4600  0  3  4600
3  5  3400   6   89  4600  4600  6  0  4600
4  7  3400   0   76  4600  4600  8  8  4600

In [226]:
#Basic indexing

oil_data = {'France':{'2015-Q1': 100.1, '2015-Q2': 104.6, '2015-Q3': 400, '2015-Q4': 340},
            'Germany':{'2015-Q1': 100.1, '2015-Q2': 156.6, '2015-Q3': 350, '2015-Q4': 490},
           'Poland':{'2015-Q1': 99.1, '2015-Q2': 103.6, '2015-Q3': 440, '2015-Q4': 440}}
oil_data

{'France': {'2015-Q1': 100.1,
  '2015-Q2': 104.6,
  '2015-Q3': 400,
  '2015-Q4': 340},
 'Germany': {'2015-Q1': 100.1,
  '2015-Q2': 156.6,
  '2015-Q3': 350,
  '2015-Q4': 490},
 'Poland': {'2015-Q1': 99.1, '2015-Q2': 103.6, '2015-Q3': 440, '2015-Q4': 440}}

In [229]:
oil_df = pd.DataFrame.from_dict(oil_data)
print(pd.DataFrame(oil_data))
oil_df

         France  Germany  Poland
2015-Q1   100.1    100.1    99.1
2015-Q2   104.6    156.6   103.6
2015-Q3   400.0    350.0   440.0
2015-Q4   340.0    490.0   440.0

         France  Germany  Poland
2015-Q1   100.1    100.1    99.1
2015-Q2   104.6    156.6   103.6
2015-Q3   400.0    350.0   440.0
2015-Q4   340.0    490.0   440.0

In [233]:
oil_df['France']

2015-Q1    100.1
2015-Q2    104.6
2015-Q3    400.0
2015-Q4    340.0
Name: France, dtype: float64

In [235]:
oil_df[['Poland','Germany','France']]

         Poland  Germany  France
2015-Q1    99.1    100.1   100.1
2015-Q2   103.6    156.6   104.6
2015-Q3   440.0    350.0   400.0
2015-Q4   440.0    490.0   340.0

In [238]:
oil_df.France

2015-Q1    100.1
2015-Q2    104.6
2015-Q3    400.0
2015-Q4    340.0
Name: France, dtype: float64

In [252]:
oil_df[::-1]

         France  Germany  Poland
2015-Q4   340.0    490.0   440.0
2015-Q3   400.0    350.0   440.0
2015-Q2   104.6    156.6   103.6
2015-Q1   100.1    100.1    99.1

In [256]:
#label oriented indexing

snow_data = {'Months' : ['january','february','march','april','may','june'],
              'Avg low temp' : [26,34,25,45,23,21],
             'Avg precip' : [17.8,12.3,11.7,34,12.3,11.5],
            'Avg snowdays' : [3.0,6.0,5.0,2.0,3.3,4.5]}

In [257]:
snow_df = pd.DataFrame(snow_data, index = snow_data['Months'],columns = ['Avg low temp','Avg precip','Avg snowdays'])
snow_df

          Avg low temp  Avg precip  Avg snowdays
january             26        17.8           3.0
february            34        12.3           6.0
march               25        11.7           5.0
april               45        34.0           2.0
may                 23        12.3           3.3
june                21        11.5           4.5

In [259]:
snow_df.loc['january']

Avg low temp    26.0
Avg precip      17.8
Avg snowdays     3.0
Name: january, dtype: float64

In [262]:
snow_df.loc[['january','june']] #row,col

         Avg low temp  Avg precip  Avg snowdays
january            26        17.8           3.0
june               21        11.5           4.5

In [270]:
print(snow_df.loc['may','Avg low temp']) # or snow_df.loc['may']['Avg low temp']    #row,col
snow_df['Avg low temp']['may']   #col, row

23

23

In [286]:
oil_data = {'France':{'2015-Q1': 100.1, '2015-Q2': 104.6, '2015-Q3': 400, '2015-Q4': 340},
            'Germany':{'2015-Q1': 100.1, '2015-Q2': 156.6, '2015-Q3': 350, '2015-Q4': 490},
           'Poland':{'2015-Q1': 99.1, '2015-Q2': 103.6, '2015-Q3': 440, '2015-Q4': 440}}
oil_df = pd.DataFrame(oil_data)
oil_df

         France  Germany  Poland
2015-Q1   100.1    100.1    99.1
2015-Q2   104.6    156.6   103.6
2015-Q3   400.0    350.0   440.0
2015-Q4   340.0    490.0   440.0

In [307]:
#conditional indexing
oil_df.loc['2015-Q1',oil_df.loc['2015-Q1'] >100]

France     100.1
Germany    100.1
Name: 2015-Q1, dtype: float64

In [309]:
oil_df.loc[:,oil_df.loc['2015-Q1'] >100]

         France  Germany
2015-Q1   100.1    100.1
2015-Q2   104.6    156.6
2015-Q3   400.0    350.0
2015-Q4   340.0    490.0

In [311]:
oil_df.loc['2015-Q1'] >100

France      True
Germany     True
Poland     False
Name: 2015-Q1, dtype: bool

In [316]:
z = {'x': [1,2,3,4,5],'y':[6,9,7,8,10],'z':[11,12,13,14,15]}
z

{'x': [1, 2, 3, 4, 5], 'y': [6, 9, 7, 8, 10], 'z': [11, 12, 13, 14, 15]}

In [319]:
x1 = pd.DataFrame(z, index=list(range(0,10,2)))
x1

   x   y   z
0  1   6  11
2  2   9  12
4  3   7  13
6  4   8  14
8  5  10  15

In [337]:
print(x1.iloc[:,0:])
print(x1.loc[:,'x':'z'])

   x   y   z
0  1   6  11
2  2   9  12
4  3   7  13
6  4   8  14
8  5  10  15
   x   y   z
0  1   6  11
2  2   9  12
4  3   7  13
6  4   8  14
8  5  10  15

In [339]:
x1.iloc[0,0]

1

In [345]:
stock_prices = pd.read_csv("D:\Python_programming\Term1\stock_index_prices.csv")
stock_prices

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
0   2014/02/21      open  4282.17  1841.07       1166.25
1   2014/02/21     close  4263.41  1836.25       1164.63
2   2014/02/21      high  4284.85  1846.13       1168.43
3   2014/02/24      open  4273.32  1836.78       1166.74
4   2014/02/24     close  4292.97  1847.61       1174.55
5   2014/02/24      high  4311.13  1858.71       1180.29
6   2014/02/25      open  4298.48  1847.66       1176.00
7   2014/02/25     close  4287.59  1845.12       1173.95
8   2014/02/25      high  4307.51  1852.91       1179.43
9   2014/02/26      open  4300.45  1845.79       1176.11
10  2014/02/26     close  4292.06  1845.16       1181.72
11  2014/02/26      high  4316.82  1852.65       1188.06
12  2014/02/27      open  4291.47  1844.90       1179.28
13  2014/02/27     close  4318.93  1854.29       1187.94
14  2014/02/27      high  4322.46  1854.53       1187.94
15  2014/02/28      open  4323.52  1855.12       1189.19
16  2014/02/28     close  4308.12  1859.45       1183.03
17  2014/02/28      high  4342.59  1867.92       1193.50

In [367]:
stock_prices.ix[(stock_prices['PriceType'] == 'close') & (stock_prices['Nasdaq'] > 4300)]

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
13  2014/02/27     close  4318.93  1854.29       1187.94
16  2014/02/28     close  4308.12  1859.45       1183.03

In [371]:
stock_prices.loc[(stock_prices.iloc[:,1] == 'close') & (stock_prices.iloc[:,2] > 4300)]

   TradingDate PriceType   Nasdaq  S&P 500  Russell 2000
13  2014/02/27     close  4318.93  1854.29       1187.94
16  2014/02/28     close  4308.12  1859.45       1183.03

In [ ]:
stock_prices.loc[(stock_prices.iloc[:,1] == 'close') & (stock_prices.iloc[:,2] > 4300)]